import React from 'react';
import {StyleSheet, Text, View} from 'react-native';
import {COLOR} from '../constants/Colors';
import {Fonts} from '../constants/fonts';

const Terms = () => {
  return (
    <View style={{padding: 30}}>
      <Text style={styles.headerTitle}>
        ข้อกำหนดและเงื่อนไขในการยืมเครื่องและอุปกรณ์บริษัท
      </Text>
      <Text style={styles.titleStyle}>คํานิยาม</Text>

      <Text>
        <Text style={styles.titleStyle}>“บริษัท”</Text>{' '}
        <Text style={styles.textStyle}>
          หมายถึง บริษัท ไทยน้ำทิพย์ คอร์ปอเรชั่น จำกัด (มหาชน)
          รวมถึงผู้สืบสิทธิของบริษัท
        </Text>
      </Text>
      <Text>
        <Text style={styles.titleStyle}>“ลูกค้า”</Text>{' '}
        <Text style={styles.textStyle}>
          หมายถึง
          ผู้ยืมเครื่องและอุปกรณ์ตามชื่อและที่อยู่ที่ระบุไว้ในหน้าแรกของคำยอยืมเครื่องและอุปกรณ์
          (ซึ่งต่อไปในที่นี้จะเรียก ขอดังกล่าวว่า ศาขอยืมฯ”)
        </Text>
      </Text>
      <Text>
        <Text style={styles.titleStyle}>“เครื่องและอุปกรณ์”</Text>{' '}
        <Text style={styles.textStyle}>
          หมายถึง เครื่องและอุปกรณ์ที่เป็นทรัพย์สินของบริษัท เช่น เครื่อง
          Post-Mix, Vending Machine, ตู้เย็น, ท่อ แก๊ส ถังน้ำเชื่อม
          รวมทั้งชุดปรับแรงดันของแก๊ส, ชุดปั๊มดูดน้ำเชื่อม
          หรือชิ้นส่วนหรือวัสดุอุปกรณ์ใด ๆ ที่ใช้ร่วมกับหรือเป็นส่วนประกอบ
          ของเครื่องและอุปกรณ์ดังกล่าว
        </Text>
      </Text>
      <Text style={styles.textStyle}>
        1.
        ลูกค้าตกลงยืมเครื่องและอุปกรณ์จากบริษัทตามรายละเอียดข้างต้นของคำขอยืมฯ
        ฉบับนี้
        เพื่อใช้ในการประกอบธุรกิจค้าขายที่ไม่ขัดด่อกฎหมายหรือศีลธรรมอันดีของประชาชน
        โดยบริษัทมีสิทธิเปลี่ยนแปลง,แก้ไข หรือยกเลิกการให้ยืมทรัพย์สินดังกล่าว
        ในเวลา โคเวลาหนึ่งก็ได้ ตามที่บริษัทจะเห็นสมควร
      </Text>
      <Text style={styles.textStyle}>
        2. ลูกค้าตกลงปฏิบัติตามหลักเกณฑ์และระเบียบต่าง ๆ
        เกี่ยวกับการยืมเครื่องและอุปกรณ์และเรื่องที่เกี่ยวข้องที่บริษัทเป็นผู้กำหนดขึ้นทุกประการ
        ซึ่งหลักเกณฑ์หรือระเบียบดังกล่าวอาจมีการเปลี่ยนแปลงแก้ไขภายหลังได้
        ตามที่บริษัทจะเห็นสมควร
      </Text>
      <Text style={styles.textStyle}>
        3.
        ลูกค้าตกลงจะไม่น่าหรือยินยอมให้ผู้อื่นนำน้ำเชื่อมหรือผลิตภัณฑ์อื่นใดนอกจากน้ำเชื่อมหรือผลิตภัณฑ์ของบริษัทมา
        ผสมหรือ เติมลงใน หรือ ใส่ในเครื่องและอุปกรณ์ของบริษัทอย่างเด็ดขาด
      </Text>
      <Text style={styles.textStyle}>
        4. ลูกค้าจะใช้เครื่องและอุปกรณ์เฉพาะสถานที่
        ที่ได้รับการติดตั้งจากบริษัทเท่านั้น
        โดยลูกค้าจะปฏิบัติตามคำแนะนำของบริษัทในการหาสถานที่ติดตั้งที่ให้เด่นชัด
        มองเห็นได้ง่ายและไม่น่าวัตถุอื่นใดมาปกปิดหรือลบทิ้งหรือออกตราสินค้าที่ปรากฏบนเครื่องและอุปกรณ์
        ของบริษัท
        รวมถึงรับผิดชอบดูแลสถานที่ติดตั้งให้มีระบบไฟฟ้าที่ปลอดภัยที่ไม่เป็นอันตรายต่อชีวิตและทรัพย์สินของบุคคลภายนอก
      </Text>
      <Text style={styles.textStyle}>
        5. ในการติดตั้งเครื่องและอุปกรณ์ใด ๆ ให้แก่ลูกค้าก็ดี
        ในการแจ้งให้บริษัทดำเนินการใด ๆ ตามความประสงค์ของลูกค้าก็ดึงลูกค้า
        ตกลงว่าหากบริษัทไม่พบตัวลูกค้า ณ สถานที่ติดตั้งเครื่องและอุปกรณ์ก็ดี
        หรือลูกค้าไม่อยู่ในสถานที่ที่นัดหมายไว้ก็ดี หรือบริษัทไม่พบ
        ตัวลูกค้าไม่ว่าในกรณีใด ๆ ลูกค้าตกลงมอบหมายให้พนักงาน หรือลูกจ้าง
        หรือสมาชิกในครอบครัว หรือญาติ หรือบริวารของลูกค้า หรือ
        บุคคลที่ปฏิบัติงาน
        หรืออยู่ในสถานที่ประกอบธุรกิจของลูกค้าเป็นตัวแทนของลูกค้าในการลงนามในแบบฟอร์มรับมอบทรัพย์สินของ
        บริษัท รับการติดตั้งเครื่องและอุปกรณ์ ลงนามในคำขอยืมฯ
        ฉบับนี้หรือเอกสารใด ๆ เพื่อให้บริษัทดำเนินการใด ๆ ในนามลูกค้าได้ และ
        ให้มีผลผูกพันลูกค้าเสมือนหนึ่ง ลูกค้าได้ลงนาม
        รับทรัพย์สินที่ยืมจากบริษัทและการอื่นใดที่เกี่ยวข้อง ด้วยตนเองทุกประการ
      </Text>
      <Text style={styles.textStyle}>
        6.
        ในกรณีที่มีการเปลี่ยนแปลงส่วนใดส่วนหนึ่งหรือทั้งหมดของทรัพย์สินเครื่องและอุปกรณ์
        ลูกค้าตกลงให้ถือว่าเอกสารทั้งหลาย
        เกี่ยวข้องกับการเปลี่ยนแปลงภายหลังดังกล่าว เป็นส่วนหนึ่งของค่าขอยืมฯ
        ฉบับนี้ด้วย{' '}
      </Text>
      <Text style={styles.textStyle}>
        7. ลูกค้าตกลงจะดูแลและบำรุงรักษาเครื่องและอุปกรณ์ต่าง ๆ
        ที่ยืมจากบริษัทให้อยู่ในสภาพที่ดีและใช้งานได้เสมอ
        โดยเฉพาะอย่างยิ่งจะปฏิบัติให้เป็นไปตามคำแนะนำของบริษัทเพื่อการบำรุงรักษาเครื่องและอุปกรณ์ให้อยู่ในสภาพที่ดีตลอดไปด้วยค่าใช้จ่ายของ
        ลูกค้า รวมทั้งรับผิดชอบความเสียหายใด ๆ ที่เกิดจากการใช้ผิดประเภท
        ผิดวิธีการหรือด้วยความประมาทเลินเล่อ
        และการไม่ดูแลสถานที่ติดตั้งให้ปลอดภัยเมื่อทรัพย์สินสูญหายหรือถูกโจรกรรม
        รวมถึงจะต้องมีการควบคุมแมลงและสัตว์นำโรคไม่ให้มีอยู่ในบริเวณสถานที่ติดตั้งเครื่องและอุปกรณ์ต่างๆ
        ที่ยืมจากบริษัทด้วย
      </Text>
      <Text style={styles.textStyle}>
        8. ลูกค้าตกลงเป็นผู้ชำระค่าไฟฟ้า
        รวมทั้งค่าสาธารณูปโภคทั้งหลายที่เกี่ยวข้องกับเครื่องและอุปกรณ์ที่ลูกค้าได้ยืมจากบริษัทตามคำขอยืมฯ
        ฉบับนี้
      </Text>
      <Text style={styles.textStyle}>
        9.
        ลูกค้าทราบว่าเครื่องและอุปกรณ์ที่ลูกค้าซึมจากบริษัทนั้นเป็นทรัพย์สินของบริษัท
        ลูกค้าจึงตกลงว่าจะไม่จําหน่ายจ่ายโอนหรือ เคลื่อนย้ายหรือกระทำการใด ๆ
        หรือยินยอมให้มีการกระทําใด ๆ
        อันเป็นเหตุให้เครื่องและอุปกรณ์ดังกล่าวพ้นขาดจากการครอบครอง
        ของตนไม่ว่ากรณีใด ๆ รวมทั้งจะไม่กระทําการใด ๆ หรือยินยอมให้มีการกระทำใด
        ๆ อันก่อให้เกิดการดัดแปลงแก้ไข ต่อเติม หรือความ เสียหาย สูญเสีย
        หรือชำรุด บกพร่องต่อเครื่องและอุปกรณ์
        รวมทั้งจะป้องกันขัดขวางไม่ให้เกิดเหตุการณ์ดังกล่าวทั้งหลายขึ้นด้วยมิฉะนั้นลูกค้าตกลงรับผิดชอบชดใช้ค่าเสียหายและค่าใช้จ่ายทั้งหลายทั้งปวงที่เกี่ยวข้องให้แก่บริษัท
      </Text>
      <Text style={styles.textStyle}>
        10. ลูกค้าตกลงให้บริษัทถอนเครื่องและอุปกรณ์ได้ทันที
        ในกรณีที่มีการซื้อผลิตภัณฑ์มากว่าเกณฑ์ที่บริษัทได้กำหนด
        หรือลูกค้านำนำ้เชื่อมหรือผลิตภัณฑ์อื่นใดนอกจากน้ำเชื่อมหรือผลิตภัณฑ์ของบริษัทมาผสมหรือเดิมลงในหรือใส่ในเครื่องและอุปกรณ์ของบริษัท
      </Text>
      <Text style={styles.textStyle}>
        11. ลูกค้ารับทราบและยินยอมให้บริษัทมีสิทธิเข้าตรวจสอบทรัพย์สินของบริษัท
        รวมทั้งการใช้สอย
        การเก็บรักษาและการดูแลรักษาทรัพย์สินของลูกค้าในเวลาใดๆระหว่างประกอบกิจการของลูกค้าได้ตลอดเวลา
      </Text>
      <Text style={styles.textStyle}>
        12. ในกรณีที่ลูกค้าปฏิบัติผิดสัญญา หรือผิดข้อกำหนด
        หรือเงื่อนไขข้อใดข้อหนึ่งหรือผิดนัดชำระค่าสินค้ากับบริษัท
        ให้ถือว่าคำขอยืมฯ ฉบับนี้เป็นอันสิ้นสุดลงทันที
        โดยบริษัทไม่จำเป็นต้องแจ้งบอกเลิกคำขอยืมฯ
        ในกรณีดังกล่าวบริษัทมีสิทธิติดตามเอาคืนทรัพย์สิน
        เครื่องและอุปกรณ์ทั้งหมดที่ลูกค้าได้ยืมไปได้ทันที
        โดยไม่ต้องบอกกล่าวแจ้งให้ลูกค้าทราบล่วงหน้า
      </Text>
      <Text style={styles.textStyle}>
        13. ในกรณีที่คำขอยืมฯ ฉบับนี้สิ้นสุดลงไม่ว่ากรณีใด ๆ
        ลูกค้าตกลงส่งมอบเครื่องและอุปกรณ์คืนแก่บริษัททันที
        มิฉะนั้นลูกค้าตกลงจะต้องรับผิดชอบชดใช้ค่าเครื่องและอุปกรณ์ทั้งหมดที่ยืมจากบริษัท
        รวมทั้งค่าใช้จ่ายในการติดตามทวงถาม
        ค่าใช้จ่ายในการนำเครื่องและอุปกรณ์กลับคืนมายังบริษัท ค่าทนายความ
        ค่าฤชาธรรมเนียมในศาลและในชั้นบังคับคดี รวมทั้ง
        ค่าเสียหายอื่นๆที่ตามมาด้วย
      </Text>
      <Text style={styles.textStyle}>
        14. ลูกค้าตกลงว่าจะไม่เรียกร้องค่าเสียหายหรือค่าใช้จ่ายหรือเงินใด ๆ
        ในการดำเนินการใดๆ ของบริษัทหรือพนักงานหรือตัวแทนของบริษัทตามคำขอยืมฯ
        ฉบับนี้
      </Text>
      <Text style={styles.textStyle}>
        15. ลูกค้าจะปฏิบัติตาม พระราชบัญญัติควบคุมข้อมูลส่วนบุคคล พ.ศ
        2562(และที่มีการแก้ไขเพิ่มเติม พระราชบัญญัติ
        ควบคุมข้อมูลส่วนบุคคล)และกฏหมายอื่นใดที่เกี่ยวข้องที่เกี่ยวกับการเก็บรักษาความลับ
        ความเป็นส่วนตัว
        การป้องกันและความปลอดภัยของข้อมูลส่วนบุคคลรวมถึงหลักเกณฑ์และข้อบังคับใดๆที่ออกภายใต้
        พ.ร.บ ควบคุมข้อมูลส่วนบุคคล
        ตลอดจนแนวปฏิบัติของคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
      </Text>
      <Text style={styles.textStyle}>
        16.
        ลูกค้าตกลงที่จะให้บริษัททำลายและหรือสำเนาข้อมูลส่วนบุคคลของลูกค้าที่มีอยู่ในความครอบครองออกจากระบบสารสนเทศ
        ทันที เมื่อมีการค้นทรัพย์สินที่ยืมเรียบร้อยแล้ว เว้นแต่มีกฎหมายโดๆ
        กำหนดให้เก็บตัวสำเนาของข้อมูลส่วนบุคคลดังกล่าวไว้ได้
      </Text>
      <Text style={styles.textStyle}>
        17. ในกรณีบริษัทให้ลูกค้ายืมเครื่องโทลมิกซ์ (POST-MIX) ตามคำขอยืมฯ
        ลูกค้าจะต้องเปลี่ยนไส้กรองตามระยะเวลาที่บริษัทกำหนด
        หรือกรณีที่ลูกค้ามีความประสงค์ย้ายจุดติดตั้งเครื่องดังกล่าวลูกค้าจะต้องเป็นผู้รับผิดชอบค่าใช้จ่ายเองทั้งสิ้น
        โดยการชำระค่าใช้จ่าย ให้กับบริษัท เบปโปร เอเชีย จํากัดและ/หรือ ตัวแทน
        ซึ่งเป็นผู้ให้บริการติดตั้ง บำรุงรักษาเครื่องและอุปกรณ์ ให้กับบริษัทด้วย
      </Text>
      <Text style={styles.textStyle}>
        18. ลูกค้าจะปฏิบัติตาม พระราชบัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์ พ.ศ.
        2544 (และที่แก้ไขเพิ่มเติมพระราชบัญญัติว่าด้วย ธุรกรรมทางอิเล็กทรอนิกส์
        และกฎหมายอื่นใดที่เกี่ยวข้องรวมถึงหลักเกณฑ์และแนวทางปฏิบัติและข้อบังคับใดที่ออกภายใต้
        พระราช บัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์ พ.ศ. 2544
      </Text>
      <Text style={styles.textStyle}>
        19 สาขอยืมเครื่องและอุปกรณ์
        ข้อกำหนดและเงื่อนไขในการยืมเครื่องและอุปกรณ์ดังกล่าวมาข้างต้น
        ทั้งสองฝ่ายใต้อ่านข้อความและ เข้าใจถูกต้องตรงกัน
        จึงได้ลงลายมือชื่อไว้เป็นหลักฐาน
      </Text>
    </View>
  );
};

const styles = StyleSheet.create({
  btn: {
    width: '100%',
    height: 60,
    padding: 10,
    textAlign: 'center',
    fontFamily: Fonts.Prompt_Medium,
    fontSize: 22,
    borderWidth: 1,
    borderColor: 'white',
    backgroundColor: COLOR.secondary_primary_color,
    borderRadius: 35,
    marginTop: 20,
  },
  btnOutline: {
    width: '50%',
    height: 60,
    padding: 10,
    textAlign: 'center',
    fontFamily: Fonts.Prompt_Medium,
    fontSize: 22,
    borderWidth: 1,
    backgroundColor: 'white',
    borderColor: COLOR.secondary_primary_color,
    borderRadius: 35,
    marginTop: 20,
  },
  headerTitle: {
    fontSize: 18,
    fontFamily: Fonts.Prompt_Medium,
    textDecorationLine: 'underline',
  },
  titleStyle: {
    fontSize: 16,
    fontFamily: Fonts.Prompt_Medium,
    fontWeight: 'bold',
  },
  textStyle: {
    fontSize: 16,
    fontFamily: Fonts.Prompt_Light,
  },
  container: {
    flex: 1,
    backgroundColor: 'white',
    borderWidth: 1,
    borderColor: '#ddd',
    padding: 20,
  },
});

export default Terms;
